Repository: postalsys/joi-messages
Catalog: translations/*.po
Languages: nl, pl

source: {{#label}} failed custom validation because {{#error.message}}
nl: {{#label}} faalde aangepaste validatie omdat {{#error.message}}
pl: {{#label}} nie powiodła się walidacja niestandardowa, ponieważ {{#error.message}}

source: {{#label}} threw an error when running default method
nl: {{#label}} gaf een foutmelding bij het uitvoeren van de standaardmethode
pl: {{#label}} rzucił błąd podczas uruchamiania domyślnej metody

source: {{#label}} threw an error when running failover method
nl: {{#label}} gaf een fout bij het uitvoeren van de failover-methode
pl: {{#label}} rzucił błąd podczas uruchamiania metody awaryjnej

source: {{#label}} contains an invalid value
nl: {{#label}} bevat een ongeldige waarde
pl: {{#label}} zawiera nieprawidłową wartość

source: {{#label}} must be {if(#valids.length == 1, "", "one of ")}{{#valids}}
nl: {{#label}} moet zijn {if(#valids.length == 1, "", "een van ")}{{#valids}}
pl: {{#label}} musi być {if(#valids.length == 1, "", "jednym z ")}{{#valids}}

source: {{#label}} {{#arg}} references {{:#ref}} which {{#reason}}
nl: {{#label}} {{#arg}} verwijzingen {{:#ref}} die {{#reason}}
pl: {{#label}} {{#arg}} odnosi się do {{:#ref}}, który {{#reason}}

source: {{#label}} is required
nl: {{#label}} is vereist
pl: {{#label}} jest wymagane

source: {{#label}} is not allowed
nl: {{#label}} is niet toegestaan
pl: {{#label}} jest niedozwolone

source: {{#label}} does not match all of the required types
nl: {{#label}} komt niet overeen met alle vereiste types
pl: {{#label}} nie pasuje do wszystkich wymaganych typów

source: {{#label}} does not match any of the allowed types
nl: {{#label}} komt niet overeen met een van de toegestane typen
pl: {{#label}} nie pasuje do żadnego z dozwolonych typów

source: {{#label}} matches more than one allowed type
nl: {{#label}} komt overeen met meer dan één toegestaan type
pl: {{#label}} pasuje do więcej niż jednego dozwolonego typu

source: {{#label}} must be one of {{#types}}
nl: {{#label}} moet een van {{#types}} zijn
pl: {{#label}} musi być jednym z {{#types}}

source: {{#label}} must be an array
nl: {{#label}} moet een matrix zijn
pl: {{#label}} musi być tablicą

source: {{#label}} contains an excluded value
nl: {{#label}} bevat een uitgesloten waarde
pl: {{#label}} zawiera wykluczoną wartość

source: {{#label}} does not contain at least one required match for type {:#patternLabel}
nl: {{#label}} bevat niet minstens één vereiste overeenkomst voor type {:#patternLabel}
pl: {{#label}} nie zawiera co najmniej jednego wymaganego dopasowania dla typu {{:#patternLabel}}

source: {{#label}} does not contain at least one required match
nl: {{#label}} bevat niet minstens één vereiste overeenkomst
pl: {{#label}} nie zawiera co najmniej jednego wymaganego dopasowania

source: {{#label}} does not contain {{#knownMisses}} and {{#unknownMisses}} other required value(s)
nl: {{#label}} bevat geen {{#knownMisses}} en {{#unknownMisses}} andere vereiste waarde(n)
pl: {{#label}} nie zawiera {{#knownMisses}} i {{#unknownMisses}} innych wymaganych wartości

source: {{#label}} does not contain {{#knownMisses}}
nl: {{#label}} bevat {{#knownMisses}} niet
pl: {{#label}} nie zawiera {{#knownMisses}}

source: {{#label}} does not contain {{#unknownMisses}} required value(s)
nl: {{#label}} bevat geen {{#unknownMisses}} vereiste waarde(n)
pl: {{#label}} nie zawiera {{#unknownMisses}} wymaganych wartości

source: {{#label}} must contain {{#limit}} items
nl: {{#label}} moet {{#limit}} items bevatten
pl: {{#label}} musi zawierać elementy {{#limit}}

source: {{#label}} must contain less than or equal to {{#limit}} items
nl: {{#label}} moet minder dan of gelijk aan {{#limit}} items bevatten
pl: {{#label}} musi zawierać {{#limit}} lub mniej elementów

source: {{#label}} must contain at least {{#limit}} items
nl: {{#label}} moet ten minste {{#limit}} items bevatten
pl: {{#label}} musi zawierać co najmniej {{#limit}} elementów

source: {{#label}} must contain at most {{#limit}} items
nl: {{#label}} moet maximaal {{#limit}} items bevatten
pl: {{#label}} musi zawierać co najwyżej {{#limit}} elementów

source: {{#label}} must be sorted in {#order} order by {{#by}}
nl: {{#label}} moet worden gesorteerd op {#order} door {{#by}}
pl: {{#label}} musi być posortowane w kolejności {{#order}} według {{#by}}

source: {{#label}} cannot be sorted due to mismatching types
nl: {{#label}} kan niet worden gesorteerd vanwege niet overeenkomende types
pl: {{#label}} nie może zostać posortowane z powodu niezgodności typów

source: {{#label}} cannot be sorted due to unsupported type {#type}
nl: {{#label}} kan niet worden gesorteerd vanwege niet-ondersteund type {#type}
pl: {{#label}} nie może zostać posortowane z powodu nieobsługiwanego typu {{#type}}

source: {{#label}} must not be a sparse array item
nl: {{#label}} mag geen sparse array-item zijn
pl: {{#label}} nie może być elementem tablicy rzadkiej tablicy

source: {{#label}} contains a duplicate value
nl: {{#label}} bevat een dubbele waarde
pl: {{#label}} zawiera zduplikowaną wartość

source: {{#label}} must be a boolean
nl: {{#label}} moet een boolean zijn
pl: {{#label}} musi być wartością logiczną

source: {{#label}} must be a valid date
nl: {{#label}} moet een geldige datum zijn
pl: {{#label}} musi być prawidłową datą

source: {{#label}} must be in {msg("date.format." + #format) || #format} format
nl: {{#label}} moet in {msg("date.format." + #format) || #format} formaat zijn
pl: {{#label}} musi być w formacie {msg("date.format." + #format) || #format}

source: {{#label}} must be greater than {{:#limit}}
nl: {{#label}} moet groter zijn dan {{:#limit}}
pl: {{#label}} musi być większa niż {{:#limit}}

source: {{#label}} must be less than {{:#limit}}
nl: {{#label}} moet kleiner zijn dan {{:#limit}}
pl: {{#label}} musi być mniejsza niż {{:#limit}}

source: {{#label}} must be less than or equal to {{:#limit}}
nl: {{#label}} moet kleiner of gelijk zijn aan {{:#limit}}
pl: {{#label}} musi być mniejsza lub równa {{:#limit}}

source: {{#label}} must be greater than or equal to {{:#limit}}
nl: {{#label}} moet groter zijn dan of gelijk aan {{:#limit}}
pl: {{#label}} musi być większa lub równa {{:#limit}}

source: ISO 8601 date
nl: ISO 8601 datum
pl: Data ISO 8601

source: timestamp or number of milliseconds
nl: tijdstempel of aantal milliseconden
pl: znacznik czasu lub liczba milisekund

source: timestamp or number of seconds
nl: tijdstempel of aantal seconden
pl: znacznik czasu lub liczba sekund

source: {{#label}} contains {{#presentWithLabels}} without its required peers {{#missingWithLabels}}
nl: {{#label}} bevat {{#presentWithLabels}} zonder zijn vereiste gelijken {{#missingWithLabels}}
pl: {{#label}} zawiera {{#presentWithLabels}} bez swoich wymaganych odpowiedników {{#missingWithLabels}}

source: {{#label}} is invalid because {if(#subject.key, `"` + #subject.key + `" failed to ` + (#message || "pass the assertion test"), #message || "the assertion failed")}
nl: {{#label}} is ongeldig omdat {if(#subject.key, `"` + #subject.key + `" failed to ` + (#message || "pass the assertion test"), #message || "the assertion failed")}
pl: {{#label}} jest nieprawidłowe, ponieważ {if(#subject.key, `"` + #subject.key + `" nie powiódł się ` + (#message || "test asercji"), #message || "asercja nie powiodła się")}

source: {{#label}} must be of type {{#type}}
nl: {{#label}} moet van het type {{#type}} zijn
pl: {{#label}} musi być typu {{#type}}

source: {{#label}} must be an instance of {{:#type}}
nl: {{#label}} moet een instantie zijn van {{:#type}}
pl: {{#label}} musi być instancją {{:#type}}

source: {{#label}} must have {{#limit}} key{if(#limit == 1, "", "s")}
nl: {{#label}} moet {{#limit}} key{if(#limit == 1, "", "s")} hebben
pl: {{#label}} musi mieć {{#limit}} klucz{if(#limit == 1, "", "y")}

source: {{#label}} must have less than or equal to {{#limit}} key{if(#limit == 1, "", "s")}
nl: {{#label}} moet kleiner of gelijk zijn aan {{#limit}} key{if(#limit == 1, "", "s")}
pl: {{#label}} musi mieć {{#limit}} {if(#limit == 1, "klucz", "lub mniej kluczy")}

source: {{#label}} must have at least {{#limit}} key{if(#limit == 1, "", "s")}
nl: {{#label}} moet minimaal {{#limit}} key{if(#limit == 1, "", "s")} hebben
pl: {{#label}} musi mieć co najmniej {{#limit}} klucz{if(#limit == 1, "", "y")}

source: {{#label}} must contain at least one of {{#peersWithLabels}}
nl: {{#label}} moet ten minste één van {{#peersWithLabels}} bevatten
pl: {{#label}} musi zawierać co najmniej jedną z {{#peersWithLabels}}

source: {{:#mainWithLabel}} must not exist simultaneously with {{#peersWithLabels}}
nl: {{:#mainWithLabel}} mag niet gelijktijdig bestaan met {{#peersWithLabels}}
pl: {{:#mainWithLabel}} nie może istnieć jednocześnie z {{#peersWithLabels}}

source: {{#label}} contains a conflict between optional exclusive peers {{#peersWithLabels}}
nl: {{#label}} bevat een conflict tussen optionele exclusieve peers {{#peersWithLabels}}
pl: {{#label}} zawiera konflikt między opcjonalnymi, wzajemnie wykluczającymi się elementami równorzędnymi {{#peersWithLabels}}

source: {{#label}} keys failed to match pattern requirements
nl: {{#label}} sleutels komen niet overeen met patroonvereisten
pl: Klucze {{#label}} nie spełniły wymagań wzorca

source: {{#label}} must be a Joi reference
nl: {{#label}} moet een Joi-referentie zijn
pl: {{#label}} musi być referencją Joi

source: {{#label}} must be a RegExp object
nl: {{#label}} moet een RegExp-object zijn
pl: {{#label}} musi być obiektem RegExp

source: {{#label}} cannot rename {{:#from}} because multiple renames are disabled and another key was already renamed to {{:#to}}
nl: {{#label}} kan {{:#from}} niet hernoemen omdat meervoudig hernoemen is uitgeschakeld en een andere sleutel al hernoemd is naar {{:#to}}
pl: {{#label}} nie może zmienić nazwy {{:#from}}, ponieważ wielokrotne zmiany nazw są wyłączone, a inny klucz został już zmieniony na {{:#to}}

source: {{#label}} cannot rename {{:#from}} because override is disabled and target {{:#to}} exists
nl: {{#label}} kan {{:#from}} niet hernoemen omdat opheffen is uitgeschakeld en doel {{:#to}} bestaat
pl: {{#label}} nie może zmienić nazwy {{:#from}}, ponieważ nadpisywanie jest wyłączone, a cel {{:#to}} istnieje

source: {{#label}} must be a Joi schema of {{#type}} type
nl: {{#label}} moet een Joi-schema van het type {{#type}} zijn
pl: {{#label}} musi być schematem Joi typu {{#type}}

source: {{:#mainWithLabel}} missing required peer {{:#peerWithLabel}}
pl: {{:#mainWithLabel}} brak wymaganego elementu równorzędnego {{:#peerWithLabel}}

source: {{:#mainWithLabel}} conflict with forbidden peer {{:#peerWithLabel}}
nl: {{:#mainWithLabel}} conflict met verboden peer {{:#peerWithLabel}}
pl: {{:#mainWithLabel}} konflikt z zabronionym elementem równorzędnym {{:#peerWithLabel}}

source: {{#label}} contains a conflict between exclusive peers {{#peersWithLabels}}
nl: {{#label}} bevat een conflict tussen exclusieve peers {{#peersWithLabels}}
pl: {{#label}} zawiera konflikt między wykluczającymi się elementami równorzędnymi {{#peersWithLabels}}

source: {{#label}} must have an arity of {{#n}}
nl: {{#label}} moet een ariteit hebben van {{#n}}
pl: {{#label}} musi mieć argumentowość równą {{#n}}

source: {{#label}} must be a class
nl: {{#label}} moet een klasse zijn
pl: {{#label}} musi być klasą

source: {{#label}} must have an arity lesser or equal to {{#n}}
nl: {{#label}} moet een ariteit hebben die kleiner of gelijk is aan {{#n}}
pl: {{#label}} musi mieć argumentowość mniejszą lub równą {{#n}}

source: {{#label}} must have an arity greater or equal to {{#n}}
nl: {{#label}} moet een ariteit hebben die groter of gelijk is aan {{#n}}
pl: {{#label}} musi mieć argumentowość większą lub równą {{#n}}

source: {{#label}} must be a number
nl: {{#label}} moet een getal zijn
pl: {{#label}} musi być liczbą

source: {{#label}} must be greater than {{#limit}}
nl: {{#label}} moet groter zijn dan {{#limit}}
pl: {{#label}} musi być większa niż {{#limit}}

source: {{#label}} cannot be infinity
nl: {{#label}} kan niet oneindig zijn
pl: {{#label}} nie może być nieskończonością

source: {{#label}} must be an integer
nl: {{#label}} moet een geheel getal zijn
pl: {{#label}} musi być liczbą całkowitą

source: {{#label}} must be less than {{#limit}}
nl: {{#label}} moet kleiner zijn dan {{#limit}}
pl: {{#label}} musi być mniejsza niż {{#limit}}

source: {{#label}} must be less than or equal to {{#limit}}
nl: {{#label}} moet kleiner of gelijk zijn aan {{#limit}}
pl: {{#label}} musi być mniejsza lub równa {{#limit}}

source: {{#label}} must be greater than or equal to {{#limit}}
nl: {{#label}} moet groter zijn dan of gelijk aan {{#limit}}
pl: {{#label}} musi być większa lub równa {{#limit}}

source: {{#label}} must be a multiple of {{#multiple}}
nl: {{#label}} moet een veelvoud zijn van {{#multiple}}
pl: {{#label}} musi być wielokrotnością {{#multiple}}

source: {{#label}} must be a negative number
nl: {{#label}} moet een negatief getal zijn
pl: {{#label}} musi być liczbą ujemną

source: {{#label}} must be a valid port
nl: {{#label}} moet een geldige poort zijn
pl: {{#label}} musi być prawidłowym portem

source: {{#label}} must be a positive number
nl: {{#label}} moet een positief getal zijn
pl: {{#label}} musi być liczbą dodatnią

source: {{#label}} must have no more than {{#limit}} decimal places
nl: {{#label}} mag niet meer dan {{#limit}} decimalen hebben
pl: {{#label}} nie może mieć więcej niż {{#limit}} miejsc po przecinku

source: {{#label}} must be a safe number
nl: {{#label}} moet een veilig getal zijn
pl: {{#label}} musi być bezpieczną liczbą

source: {{#label}} must only contain alpha-numeric characters
nl: {{#label}} mag alleen alfanumerieke tekens bevatten
pl: {{#label}} może zawierać tylko znaki alfanumeryczne

source: {{#label}} must be a string
nl: {{#label}} moet een tekenreeks zijn
pl: {{#label}} musi być ciągiem znaków

source: {{#label}} must be a valid base64 string
nl: {{#label}} moet een geldige base64 string zijn
pl: {{#label}} musi być poprawnym ciągiem base64

source: {{#label}} must be a credit card
nl: {{#label}} moet een creditcard zijn
pl: {{#label}} musi być kartą kredytową

source: {{#label}} must be a valid dataUri string
nl: {{#label}} moet een geldige dataUri-string zijn
pl: {{#label}} musi być prawidłowym ciągiem dataUri

source: {{#label}} must contain a valid domain name
nl: {{#label}} moet een geldige domeinnaam bevatten
pl: {{#label}} musi zawierać poprawną nazwę domeny

source: {{#label}} must be a valid email
nl: {{#label}} moet een geldig e-mailadres zijn
pl: {{#label}} musi być prawidłowym adresem e-mail

source: {{#label}} is not allowed to be empty
nl: {{#label}} mag niet leeg zijn
pl: {{#label}} nie może być pusta

source: {{#label}} must be a valid GUID
nl: {{#label}} moet een geldige GUID zijn
pl: {{#label}} musi być prawidłowym identyfikatorem GUID

source: {{#label}} must only contain hexadecimal characters
nl: {{#label}} mag alleen hexadecimale tekens bevatten
pl: {{#label}} może zawierać tylko znaki szesnastkowe

source: {{#label}} hex decoded representation must be byte aligned
nl: {{#label}} hex gedecodeerde weergave moet byte uitgelijnd zijn
pl: {{#label}} reprezentacja dekodowana szesnastkowo musi być wyrównana do bajtów

source: {{#label}} must be a valid hostname
nl: {{#label}} moet een geldige hostnaam zijn
pl: {{#label}} musi być poprawną nazwą hosta

source: {{#label}} must be a valid ip address with a {{#cidr}} CIDR
nl: {{#label}} moet een geldig ip-adres zijn met een {{#cidr}} CIDR
pl: {{#label}} musi być prawidłowym adresem ip z {{#cidr}} CIDR

source: {{#label}} must be a valid ip address of one of the following versions {{#version}} with a {{#cidr}} CIDR
nl: {{#label}} moet een geldig ip-adres zijn van een van de volgende versies {{#version}} met een {{#cidr}} CIDR
pl: {{#label}} musi być prawidłowym adresem ip jednej z następujących wersji {{#version}} z {{#cidr}} CIDR

source: {{#label}} must be in iso format
nl: {{#label}} moet in iso-formaat zijn
pl: {{#label}} musi być w formacie iso

source: {{#label}} must be a valid ISO 8601 duration
nl: {{#label}} moet een geldige ISO 8601-duur zijn
pl: {{#label}} musi być prawidłowym czasem trwania ISO 8601

source: {{#label}} length must be {{#limit}} characters long
nl: {{#label}} lengte moet {{#limit}} tekens lang zijn
pl: {{#label}} musi mieć długość {{#limit}} znaków

source: {{#label}} must only contain lowercase characters
nl: {{#label}} mag alleen kleine letters bevatten
pl: {{#label}} może zawierać tylko małe litery

source: {{#label}} length must be less than or equal to {{#limit}} characters long
nl: {{#label}} lengte moet kleiner zijn dan of gelijk aan {{#limit}} tekens lang
pl: Długość {{#label}} musi być mniejsza lub równa {{#limit}} znaków

source: {{#label}} length must be at least {{#limit}} characters long
nl: {{#label}} lengte moet ten minste {{#limit}} tekens lang zijn
pl: Długość {{#label}} musi wynosić co najmniej {{#limit}} znaków

source: {{#label}} must be unicode normalized in the {{#form}} form
nl: {{#label}} moet unicode genormaliseerd zijn in de vorm {{#form}}
pl: {{#label}} musi być w postaci unicode znormalizowany do postaci {{#form}}

source: {{#label}} must only contain alpha-numeric and underscore characters
nl: {{#label}} mag alleen alfanumerieke en underscore-tekens bevatten
pl: {{#label}} może zawierać tylko znaki alfanumeryczne i podkreślenia

source: {{#label}} with value {:[.]} fails to match the required pattern: {{#regex}}
nl: {{#label}} met waarde {:[.]} komt niet overeen met het vereiste patroon: {{#regex}}
pl: {{#label}} z wartością {:[.]} nie pasuje do wymaganego wzorca: {{#regex}}

source: {{#label}} with value {:[.]} fails to match the {{#name}} pattern
nl: {{#label}} met waarde {:[.]} komt niet overeen met het {{#name}} patroon
pl: {{#label}} z wartością {:[.]} nie pasuje do wzorca {{#name}}

source: {{#label}} with value {:[.]} matches the inverted pattern: {{#regex}}
nl: {{#label}} met waarde {:[.]} komt overeen met het omgekeerde patroon: {{#regex}}
pl: {{#label}} z wartością {:[.]} pasuje do odwróconego wzorca: {{#regex}}

source: {{#label}} with value {:[.]} matches the inverted {{#name}} pattern
nl: {{#label}} met waarde {:[.]} komt overeen met het omgekeerde {{#name}} patroon
pl: {{#label}} z wartością {:[.]} pasuje do odwróconego wzorca {{#name}}

source: {{#label}} must not have leading or trailing whitespace
nl: {{#label}} mag geen voorloop- of sleepspaties bevatten
pl: {{#label}} nie może zawierać początkowych ani końcowych białych znaków

source: {{#label}} must be a valid uri
nl: {{#label}} moet een geldige uri zijn
pl: {{#label}} musi być poprawnym uri

source: {{#label}} must be a valid uri with a scheme matching the {{#scheme}} pattern
nl: {{#label}} moet een geldige uri zijn met een schema dat overeenkomt met het {{#scheme}} patroon
pl: {{#label}} musi być poprawnym uri ze schematem pasującym do wzorca {{#scheme}}

source: {{#label}} must be a valid relative uri
nl: {{#label}} moet een geldige relatieve uri zijn
pl: {{#label}} musi być prawidłowym względnym uri

source: {{#label}} must only contain uppercase characters
nl: {{#label}} mag alleen hoofdletters bevatten
pl: {{#label}} może zawierać tylko wielkie litery

source: {{#label}} must be a symbol
nl: {{#label}} moet een symbool zijn
pl: {{#label}} musi być symbolem

source: {{#label}} must be one of {{#map}}
nl: {{#label}} moet een van {{#map}} zijn
pl: {{#label}} musi być jedną z {{#map}}

source: {{#label}} must be a buffer or a string
nl: {{#label}} moet een buffer of een string zijn
pl: {{#label}} musi być buforem lub ciągiem znaków

source: {{#label}} must be {{#limit}} bytes
nl: {{#label}} moet {{#limit}} bytes zijn
pl: {{#label}} musi być {{#limit}} bajtów

source: {{#label}} must be less than or equal to {{#limit}} bytes
nl: {{#label}} moet kleiner zijn dan of gelijk aan {{#limit}} bytes
pl: {{#label}} musi być mniejsza lub równa {{#limit}} bajtów

source: {{#label}} must be at least {{#limit}} bytes
nl: {{#label}} moet minimaal {{#limit}} bytes zijn
pl: {{#label}} musi mieć co najmniej {{#limit}} bajtów
